Autodesk.Revit.DB.Structure.StructuralInstanceUsageFilter.StructuralUsage
The family instance structural usage.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralInstanceUsageFilter.#ctor(Autodesk.Revit.DB.Structure.StructuralInstanceUsage,System.Boolean)
Constructs a new instance of a filter to match family instances by structural usage,
with the option to match all family instances which are not of the given structural usage.
structuralUsage:
The structural usage to match.
inverted:
True if the filter should match all family instances which are not of the given structural usage.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.StructuralInstanceUsageFilter.#ctor(Autodesk.Revit.DB.Structure.StructuralInstanceUsage)
Constructs a new instance of a filter to match structural family instances (typically columns, beams, or braces) of the given structural usage.
structuralUsage:
The family instance structural usage.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.StructuralInstanceUsageFilter
A filter used to find elements that are structural family instances (typically columns, beams or braces) of the given structural usage.
Remarks:
This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements
before the elements are obtained and expanded. Therefore this filter does not have to be
paired with another quick filter to minimize the number of Elements that are expanded.
Since:
2011